---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidElemsInSelection
source: html/f1d7d136-364e-4b5f-0eed-890e55b8d423.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.InvalidElemsInSelection Property

Can't scale elements together.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidElemsInSelection { get; }
```